// This is an independent project of an individual developer. Dear PVS-Studio, please check it.
// PVS-Studio Static Code Analyzer for C, C++, C#, and Java: https://pvs-studio.com

#include "../../utilities/tls/tls.h"
#include "../hooks.hpp"
#include "../../GUI/GUI.h"

#include "../../renderer/fonts/weapons.h"
#include "../../renderer/fonts/verdana.h"
#include "../../renderer/images/cross.h"

#include <tinyformat/tinyformat.h>
#include "../../utilities/input_system/input_system.h"
#include "../../utilities/hotkey_system/hotkey_system.h"
#include "../../utilities/cloud/user.h"

#include <memory>
#include <chrono>
#include <thread>
#include "../../Logging.h"
#include "../../sdk/vtex/VTexParser.h"

#include "../../renderer/fonts/pixel.h"
#include "../../renderer/fonts/sans.h"

#include "../../feature/misc/hitmarker.h"
#include "../../utilities/service/flatbuffers.hpp"

#include <codecvt>
#include "../../utilities/hash.h"
#include "../feature/inventory_changer/inventory_changer.h"

struct dlight_color
{
	std::uint8_t r;
	std::uint8_t g;
	std::uint8_t b;
};

struct DynamicLight_t {
	float m_flUnk; //0x0000
	vector m_vecOrigin; //0x0004
	float m_flRadius; //0x0010
	dlight_color m_nColor; //0x0014
	std::uint8_t mult;
	float m_flDie; //0x0018
	float m_flExponent; //0x001C
	char pad_0020[40]; //0x0020
	class N000004C0* m_pSceneLayer; //0x0048
}; //Size: 0x0050

class dlight_manager
{
public:
	char pad[0x18];
	DynamicLight_t aye;
};

std::string value_to_string(hotkeys& hotkeys, hotkey_impl& hotkey) {

	std::string value = tfm::format("%d", hotkey.value[0]);

	if (hotkey.type == 0)
		value = hotkey.value[0] ? xorstr_("ON") : xorstr_("OFF");
	else if (hotkey.type == 3)
	{
		bool find = false;
		value.clear();
		value.append(xorstr_("["));
		for (auto i = 0; i < hotkey.value.size(); i++)
		{
			if (!hotkey.value[i])
				continue;

			find = true;

			value += tfm::format(xorstr_("%s, "), hotkeys.name_visuals[i]);
		}
		if (value.size() > 2)
			value.erase(value.end() - 2, value.end());
		value.append(xorstr_("]"));
		if (!find)
			value = xorstr_("None");
	}
	else if (hotkey.type == 2)
	{
		value = tfm::format(xorstr_("[%s]"), hotkeys.name_visuals[hotkey.value[0]]);
	}

	return value;
}

void render_cloud()
{
	render_size size_block = render_size(220, 50);
